package com.company.training.branching;

// Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»

public class Task2 {
	
	public static void main(String[] args) {
	
	 int a;
	 int b;
	
	 a = 1;
	 b = 2;
	
	 if (a < b) {
		 System.out.print("yes");
	    }
	 else {
		 System.out.print("no");
	    }
	
   }

}
